flow-over-heated-plate-ff/fluid2-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (inlet);
    
    readData
    (
      Velocity
      FlowTemperature-Fluid
      // PressureGradient

    );
    
    writeData
    (
      Pressure
      VelocityGradient
      FlowTemperatureGradient
    );
  };
};

FF
{
  nameP     p_rgh;
}
